Repository: taikun114/Mocolamma
Catalog: Mocolamma/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, ru, uk, zh_hans, zh_hk

source: Enter custom width
ar: أدخل العرض المخصص
de: Benutzerdefinierte Breite eingeben
es: Introduce el ancho personalizado
fr: Saisissez la largeur personnalisée
ja: カスタム幅を入力
ko: 사용자 지정 너비 입력
ru: Введите ширину
uk: Введіть ширину
zh_hans: 输入自定义宽度
zh_hk: 輸入自定義寬度

source: Enter Keep Alive Time
ar: أدخل وقت الإبقاء حيًا
de: Keep Alive Zeit eingeben
es: Introducir tiempo de Keep Alive
fr: Entrer le temps de Keep Alive
ja: キープアライブ時間を入力
ko: 유지 시간 입력
ru: Введите время удержания
uk: Введіть час утримання
zh_hans: 输入保持活动时间
zh_hk: 輸入保持活動時間

source: Enter Num Predict value
ar: أدخل قيمة عدد التوقعات
de: Wert für Vorhersageanzahl eingeben
es: Introducir valor de número de predicciones
fr: Saisir la valeur du nombre de prédictions
ja: 最大出力数の値を入力
ko: 예측 수 값 입력
ru: Введите значение количества предсказаний
uk: Введіть значення кількості передбачень
zh_hans: 输入预测数量的值
zh_hk: 輸入預測數量的值

source: Enter Repeat Last N value
ar: أدخل قيمة تكرار آخر N
de: Wert für Zuletzt N wiederholen eingeben
es: Introducir valor de repetir últimos N
fr: Saisir la valeur de répétition des N derniers
ja: 繰り返し参照範囲の値を入力
ko: 마지막 N개 반복 값 입력
ru: Введите значение повтора последних N
uk: Введіть значення повтору останніх N
zh_hans: 输入重复最后 N 个的值
zh_hk: 輸入重複最後 N 個的值

source: Enter seed value
ar: أدخل قيمة البذرة
de: Seed-Wert eingeben
es: Introduce el valor de la semilla
fr: Saisissez la valeur de la graine
ja: シード値を入力
ko: 시드 값 입력
ru: Введите сид
uk: Введіть сид
zh_hans: 输入种子值
zh_hk: 輸入種子值

source: Enter the desired image height as a number to override the above setting and manually specify the size.
ar: أدخل ارتفاع الصورة المطلوب كرقم لتجاوز الإعداد أعلاه وتحديد الحجم يدويًا.
de: Geben Sie die gewünschte Bildhöhe als Zahl ein, um die obige Einstellung zu überschreiben und die Größe manuell festzulegen.
es: Introduce la altura de imagen deseada como un número para anular la configuración anterior y especificar manualmente el tamaño.
fr: Saisissez la hauteur d'image souhaitée sous forme de nombre pour ignorer le paramètre ci-dessus et spécifier manuellement la taille.
ja: 生成したい画像の高さを数字で入力すると、上記設定を上書きして手動でサイズを指定することができます。
ko: 원하는 이미지 높이를 숫자로 입력하면 위의 설정을 무시하고 크기를 수동으로 지정할 수 있습니다.
ru: Введите желаемую высоту изображения числом, чтобы переопределить настройки выше.
uk: Введіть бажану висоту зображення числом, щоб перевизначити налаштування вище.
zh_hans: 以数字形式输入所需的图像高度，以覆盖上述设置并手动指定尺寸。
zh_hk: 以数字形式输入所需的圖片高度，以覆蓋上述設定並手動指定尺寸。

source: Enter the desired image width as a number to override the above setting and manually specify the size.
ar: أدخل عرض الصورة المطلوب كرقم لتجاوز الإعداد أعلاه وتحديد الحجم يدويًا.
de: Geben Sie die gewünschte Bildbreite als Zahl ein, um die obige Einstellung zu überschreiben und die Größe manuell festzulegen.
es: Introduce el ancho de imagen deseado como un número para anular la configuración anterior y especificar manualmente el tamaño.
fr: Saisissez la largeur d'image souhaitée sous forme de nombre pour ignorer le paramètre ci-dessus et spécifier manuellement la taille.
ja: 生成したい画像の幅を数字で入力すると、上記設定を上書きして手動でサイズを指定することができます。
ko: 원하는 이미지 너비를 숫자로 입력하면 위의 설정을 무시하고 크기를 수동으로 지정할 수 있습니다.
ru: Введите желаемую ширину изображения числом, чтобы переопределить настройки выше.
uk: Введіть бажану ширину зображення числом, щоб перевизначити налаштування вище.
zh_hans: 以数字形式输入所需的图像宽度，以覆盖上述设置并手动指定尺寸。
zh_hk: 以数字形式输入所需的圖片寬度，以覆蓋上述設定並手動指定尺寸。

source: Enter the name of the model you want to add
ar: أدخل اسم النموذج الذي تريد إضافته
de: Geben Sie den Namen des hinzuzufügenden Modells ein
es: Introduce el nombre del modelo que quieres añadir
fr: Saisissez le nom du modèle que vous souhaitez ajouter
ja: 追加したいモデル名を入力
ko: 추가할 모델 이름을 입력하세요
ru: Введите название модели, которую хотите добавить
uk: Введіть назву моделі, яку хочете додати
zh_hans: 输入您要添加的模型名称
zh_hk: 輸入您要新增的模型名稱

source: Enter the number of image generation steps as a number to override the above setting and manually specify the size.
ar: أدخل عدد خطوات توليد الصورة كرقم لتجاوز الإعداد أعلاه وتحديد الحجم يدويًا.
de: Geben Sie die Anzahl der Bilderzeugungsschritte als Zahl ein, um die obige Einstellung zu überschreiben und die Größe manuell festzulegen.
es: Introduce el número de pasos de generación de imágenes como un número para anular la configuración anterior y especificar manualmente el tamaño.
fr: Saisissez le nombre d'étapes de génération d'image sous forme de nombre pour ignorer le paramètre ci-dessus et spécifier manuellement la taille.
ja: 画像生成のステップ数を数字で入力すると、上記設定を上書きして手動でサイズを指定することができます。
ko: 이미지 생성 단계를 숫자로 입력하면 위의 설정을 무시하고 단계를 수동으로 지정할 수 있습니다.
ru: Введите количество шагов генерации числом, чтобы переопределить настройки выше.
uk: Введіть кількість кроків генерації числом, щоб перевизначити налаштування вище.
zh_hans: 以数字形式输入图像生成步数，以覆盖上述设置并手动指定尺寸。
zh_hk: 以数字形式输入圖片生成步數，以覆蓋上述設定並手動指定尺寸。

source: Enter Top-k value
ar: أدخل قيمة Top-k
de: Wert für Top-k eingeben
es: Introducir valor de Top-k
fr: Saisir la valeur de Top-k
ja: Top-kの値を入力
ko: Top-k 값 입력
ru: Введите значение Top-k
uk: Введіть значення Top-k
zh_hans: 输入 Top-k 的值
zh_hk: 輸入 Top-k 的值

source: Error
ar: خطأ
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
ru: Ошибка
uk: Помилка
zh_hans: 错误
zh_hk: 錯誤

source: Error (Connection failed)
ar: خطأ (فشل الاتصال)
de: Fehler (Verbindung fehlgeschlagen)
es: Error (error de conexión)
fr: Erreur (échec de la connexion)
ja: エラー（接続できませんでした）
ko: 오류 (연결 실패)
ru: Ошибка (ошибка подключения)
uk: Помилка (помилка підключення)
zh_hans: 错误（连接失败）
zh_hk: 錯誤（連線失敗）

source: Error (Status Code: %lld)
ar: خطأ (رمز الحالة: %lld)
de: Fehler (Status Code: %lld)
es: Error (Código de estado: %lld)
fr: Erreur (code d'état : %lld)
ja: エラー（ステータスコード: %lld）
ko: 오류 (상태 코드: %lld)
ru: Ошибка (код состояния: %lld)
uk: Помилка (код стану: %lld)
zh_hans: 错误（状态码：%lld）
zh_hk: 錯誤（狀態碼：%lld）

source: Error Occurred
ar: حدث خطأ
de: Fehler aufgetreten
es: Se ha producido un error
fr: Une erreur est survenue
ja: エラーが発生しました
ko: 오류 발생
ru: Произошла ошибка
uk: Сталася помилка
zh_hans: 发生错误
zh_hk: 發生錯誤

source: Error: Failed to serialize pull request body:
ar: خطأ: فشل في تسلسل نص طلب السحب:
de: Fehler: Serialisierung des Pull-Request-Bodys fehlgeschlagen:
es: Error: No se pudo serializar el cuerpo de la solicitud de pull:
fr: Erreur : Échec de la sérialisation du corps de la demande de pull :
ja: エラー: プルリクエストボディのシリアライズに失敗しました:
ko: 오류: 풀 요청 본문 직렬화 실패:
ru: Ошибка: не удалось сериализовать тело запроса pull:
uk: Помилка: не вдалося серіалізувати тіло запиту pull:
zh_hans: 错误：无法序列化拉取请求体：
zh_hk: 錯誤：無法序列化拉取請求體：

source: Error: Failed to serialize request body:
ar: خطأ: فشل في تسلسل نص الطلب:
de: Fehler: Serialisierung des Request-Bodys fehlgeschlagen:
es: Error: No se pudo serializar el cuerpo de la solicitud:
fr: Erreur : Échec de la sérialisation du corps de la requête :
ja: エラー: リクエストボディーのシリアライズに失敗しました:
ko: 오류: 요청 본문 직렬화 실패:
ru: Ошибка: не удалось сериализовать тело запроса:
uk: Помилка: не вдалося серіалізувати тіло запиту:
zh_hans: 错误：无法序列化请求体：
zh_hk: 錯誤：無法序列化請求體：

source: Error: Failed to serialize request body.
ar: خطأ: فشل في تسلسل جسم الطلب.
de: Fehler: Serialisierung des Request-Bodys fehlgeschlagen.
es: Error: Falló la serialización del cuerpo de la solicitud.
fr: Erreur : échec de la sérialisation du corps de la requête.
ja: エラー：リクエストボディのシリアライズに失敗しました。
ko: 오류: 요청 본문을 직렬화하지 못했습니다.
ru: Ошибка: не удалось сериализовать тело запроса.
uk: Помилка: не вдалося серіалізувати тіло запиту.
zh_hans: 错误：无法序列化请求主体。
zh_hk: 錯誤：無法序列化請求主體。

source: Error: Invalid API URL for delete.
ar: خطأ: عنوان URL لـ API غير صالح للحذف.
de: Fehler: Ungültige API-URL zum Löschen.
es: Error: URL de API no válida para eliminar.
fr: Erreur : URL d'API non valide pour la suppression.
ja: エラー: 削除するためのAPI URLが無効です。
ko: 오류: 삭제를 위한 API URL이 유효하지 않습니다.
ru: Ошибка: неверный URL API для удаления.
uk: Помилка: неправильний URL API для видалення.
zh_hans: 错误：删除操作的 API URL 无效。
zh_hk: 錯誤：刪除操作の API URL 無効。

source: Error: Invalid API URL for pull.
ar: خطأ: عنوان URL لـ API غير صالح للسحب.
de: Fehler: Ungültige API-URL zum Herunterladen.
es: Error: URL de API no válida para pull.
fr: Erreur : URL d'API non valide pour le pull.
ja: エラー: プルするためのAPI URLが無効です。
ko: 오류: 풀을 위한 API URL이 유효하지 않습니다.
ru: Ошибка: неверный URL API для pull.
uk: Помилка: неправильний URL API для pull.
zh_hans: 错误：拉取操作的 API URL 无效。
zh_hk: 錯誤：拉取操作の API URL 無効。

source: Error: Invalid API URL.
ar: خطأ: عنوان URL لـ API غير صالح.
de: Fehler: Ungültige API-URL.
es: Error: URL de API no válida.
fr: Erreur : URL d'API non valide.
ja: エラー: API URLが無効です。
ko: 오류: API URL이 유효하지 않습니다.
ru: Ошибка: неверный URL API.
uk: Помилка: неправильний URL API.
zh_hans: 错误：API URL 无效。
zh_hk: 錯誤：API URL 無効。

source: Error: No Ollama server selected.
ar: خطأ: لم يتم اختيار خادم Ollama.
de: Fehler: Kein Ollama-Server ausgewählt.
es: Error: No se ha seleccionado ningún servidor Ollama.
fr: Erreur : Aucun serveur Ollama sélectionné.
ja: エラー: Ollamaサーバーが選択されていません。
ko: 오류: 선택된 Ollama 서버가 없습니다.
ru: Ошибка: не выбран сервер Ollama.
uk: Помилка: не вибрано сервер Ollama.
zh_hans: 错误：未选择 Ollama 服务器。
zh_hk: 錯誤：未選擇 Ollama 伺服器。

source: Expand thinking process
ar: توسيع عملية التفكير
de: Denkprozess ausklappen
es: Expandir proceso de pensamiento
fr: Développer le processus de réflexion
ja: 思考プロセスを展開する
ko: 사고 과정 펼치기
ru: Развернуть процесс размышления
uk: Розгорнути процес роздумів
zh_hans: 展开思考过程
zh_hk: 展開思考過程

source: Expires: %@
ar: تنتهي الصلاحية في: %@
de: Läuft ab: %@
es: Expira: %@
fr: Expire le : %@
ja: 期限切れ: %@
ko: 만료 예정: %@
ru: Истекает: %@
uk: Завершується: %@
zh_hans: 过期时间：%@
zh_hk: 過期時間：%@

source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échec
ja: 失敗しました
ko: 실패
ru: Ошибка
uk: Помилка
zh_hans: 失败
zh_hk: 失敗

source: Failed to connect to the Ollama API. Please check your network connection or server settings.
ar: فشل الاتصال بـ API لـ Ollama. يرجى التحقق من اتصال الشبكة أو إعدادات الخادم.
de: Verbindung zur Ollama API fehlgeschlagen. Bitte überprüfen Sie Ihre Netzwerkverbindung oder Servereinstellungen.
es: No se pudo conectar a la API de Ollama. Por favor, comprueba tu conexión de red o la configuración del servidor.
fr: Échec de la connexion à l'API Ollama. Veuillez vérifier votre connexion réseau ou les paramètres du serveur.
ja: Ollama APIとの接続に失敗しました。ネットワーク接続やサーバーの設定をご確認ください。
ko: Ollama API 연결에 실패했습니다. 네트워크 연결이나 서버 설정을 확인하세요.
ru: Не удалось подключиться к API Ollama. Проверьте сетевое соединение или настройки сервера.
uk: Не вдалося підключитися до API Ollama. Перевірте мережеве з'єднання або налаштування сервера.
zh_hans: 连接到 Ollama API 失败。请检查您的网络连接或服务器设置。
zh_hk: 連線至 Ollama API 失敗。請檢查您的網絡連線或伺服器設定。

source: Failed to connect. (HTTP %lld)
ar: فشل الاتصال. (HTTP %lld)
de: Verbindung fehlgeschlagen. (HTTP %lld)
es: Error al conectar. (HTTP %lld)
fr: Échec de la connexion. (HTTP %lld)
ja: 接続に失敗しました。(HTTP %lld)
ko: 연결에 실패했습니다. (HTTP %lld)
ru: Ошибка подключения. (HTTP %lld)
uk: Помилка підключення. (HTTP %lld)
zh_hans: 连接失败。(HTTP %lld)
zh_hk: 連線失敗。(HTTP %lld)

source: Failed to generate image.
ar: فشل توليد الصورة.
de: Bilderzeugung fehlgeschlagen.
es: No se pudo generar la imagen.
fr: Échec de la génération de l'image.
ja: 画像の生成に失敗しました。
ko: 이미지 생성에 실패했습니다.
ru: Не удалось сгенерировать изображение.
uk: Не вдалося згенерувати зображення.
zh_hans: 生成图像失败。
zh_hk: 圖片生成失敗。

source: Families:
ar: العائلات:
de: Familien:
es: Familias:
fr: Familles :
ja: ファミリーズ:
ko: 제품군:
ru: Семейства:
uk: Сімейства:
zh_hans: 家族：
zh_hk: 家族：

source: Family:
ar: العائلة:
de: Familie:
es: Familia:
fr: Famille :
ja: ファミリー:
ko: 제품군:
ru: Семейство:
uk: Сімейство:
zh_hans: 家族：
zh_hk: 家族：

source: Fetching models from API (%@)...
ar: جاري جلب النماذج من API (%@)...
de: Hole Modelle von API (%@)...
es: Obteniendo modelos de la API (%@)...
fr: Récupération des modèles depuis l'API (%@)...
ja: API（%@）からモデルを取得中…
ko: API(%@)에서 모델을 가져오는 중…
ru: Получение моделей из API (%@)...
uk: Отримання моделей з API (%@)...
zh_hans: 正在从 API (%@) 获取模型…
zh_hk: 正在從 API (%@) 取得模型…

source: Fetching models from demo server...
ar: جاري جلب النماذج من الخادم التجريبي...
de: Abrufen von Modellen vom Demo-Server...
es: Obteniendo modelos del servidor de demostración...
fr: Récupération des modèles depuis le serveur de démonstration...
ja: デモサーバーからモデルを取得中…
ko: 데모 서버에서 모델을 가져오는 중…
ru: Получение моделей с демо-сервера...
uk: Отримання моделей з демо-сервера...
zh_hans: 正在从演示服务器获取模型…
zh_hk: 正在從演示伺服器取得模型…

source: Filter
ar: تصفية
es: Filtro
fr: Filtrer
ja: フィルター
ko: 필터
ru: Фильтр
uk: Фільтр
zh_hans: 筛选
zh_hk: 篩選

source: Find Models
ar: البحث عن نماذج
de: Modelle finden
es: Buscar Modelos
fr: Trouver des modèles
ja: モデルを探す
ko: 모델 찾기
ru: Найти модели
uk: Знайти моделі
zh_hans: 寻找模型
zh_hk: 尋找模型

source: Format:
ar: التنسيق:
es: Formato:
ja: 形式:
ko: 형식:
ru: Формат:
uk: Формат:
zh_hans: 格式：
zh_hk: 格式：

source: Found a bug?
ar: وجدت خطأ؟
de: Fehler gefunden?
es: ¿Encontraste un error?
fr: Vous avez trouvé un bug ?
ja: バグを見つけましたか？
ko: 버그를 발견하셨나요?
ru: Нашли ошибку?
uk: Знайшли помилку?
zh_hans: 发现了错误？
zh_hk: 發現了錯誤？

source: General
ar: عام
de: Allgemein
fr: Général
ja: 一般
ko: 일반
ru: Основные
uk: Основні
zh_hans: 常规
zh_hk: 一般

source: Generating image...
ar: جاري توليد الصورة...
de: Bild wird erzeugt...
es: Generando imagen...
fr: Génération de l'image...
ja: 画像を生成中...
ko: 이미지 생성 중…
ru: Генерация изображения...
uk: Генерація зображення...
zh_hans: 正在生成图像…
zh_hk: 正在生成圖片…

source: Give It a Star
ar: امنحه نجمة
de: Sterne vergeben
es: Dale una Estrella
fr: Donner une étoile
ja: スターをつける
ko: 별점 주기
ru: Поставить звезду
uk: Поставити зірку
zh_hans: 点亮星标
zh_hk: 點亮星標

source: Give It a Star to GitHub Repository
ar: امنح مستودع GitHub نجمة
de: Vergeben Sie einen Stern für das GitHub Repository
es: Dale una Estrella al Repositorio de GitHub
fr: Donner une étoile au dépôt GitHub
ja: GitHubリポジトリにスターをつける
ko: GitHub 저장소에 별점 주기
ru: Поставить звезду репозиторию на GitHub
uk: Поставити зірку репозиторію на GitHub
zh_hans: 为 GitHub 仓库点亮星标
zh_hk: 為 GitHub 倉庫點亮星標

source: Have an idea?
ar: لديك فكرة؟
de: Haben Sie eine Idee?
es: ¿Tienes una idea?
fr: Vous avez une idée ?
ja: アイデアがありますか？
ko: 아이디어가 있으신가요?
ru: Есть идея?
uk: Маєте ідею?
zh_hans: 有主意了？
zh_hk: 有主意嗎？

source: Height
ar: الارتفاع
de: Höhe
es: Altura
fr: Hauteur
ja: 高さ
ko: 높이
ru: Высота
uk: Висота
zh_hans: 高度
zh_hk: 高度

source: Here you can generate images using models that support image generation.
ar: هنا يمكنك توليد الصور باستخدام النماذج التي تدعم توليد الصور.
de: Hier können Sie Bilder mit Modellen erzeugen, die die Bilderzeugung unterstützen.
es: Aquí puedes generar imágenes utilizando modelos que admiten la generación de imágenes.
fr: Ici, vous pouvez générer des images à l'aide de modèles prenant en charge la génération d'images.
ja: ここでは、画像生成に対応したモデルを使って画像を生成することができます。
ko: 이미지 생성을 지원하는 모델을 사용하여 이미지를 생성할 수 있습니다.
ru: Здесь вы можете генерировать изображения, используя модели с поддержкой генерации.
uk: Тут ви можете генерувати зображення, використовуючи моделі з підтримкою генерації.
zh_hans: 您可以在此处使用支持图像生成的模型来生成图像。
zh_hk: 您可以在此處使用支援圖片生成的模型來生成圖片。

source: Here you can perform a simple chat to check the model.
ar: هنا يمكنك إجراء دردشة بسيطة للتحقق من النموذج.
de: Hier können Sie einen einfachen Chat durchführen, um das Modell zu überprüfen.
es: Aquí puedes realizar un chat simple para comprobar el modelo.
fr: Ici, vous pouvez effectuer un simple chat pour vérifier le modèle.
ja: ここでは、モデルの確認に使用できる簡易的なチャットを行うことができます。
ko: 모델 확인을 위해 간단한 채팅을 할 수 있습니다.
ru: Здесь вы можете запустить простой чат для проверки модели.
uk: Тут ви можете запустити простий чат для перевірки моделі.
zh_hans: 您可以在此处进行简单聊天以检查模型。
zh_hk: 您可以在此處進行簡單聊天以檢查模型。

source: Hide Inspector
ar: إخفاء المفتش
de: Inspektor ausblenden
es: Ocultar Inspector
fr: Masquer l'inspecteur
ja: インスペクタを非表示
ko: 인스펙터 숨기기
ru: Скрыть инспектор
uk: Приховати інспектор
zh_hans: 隐藏检查器
zh_hk: 隱藏檢查器

source: Host
ar: المضيف
fr: Hôte
ja: ホスト
ko: 호스트
ru: Хост
uk: Хост
zh_hans: 主机
zh_hk: 主機

source: Host cannot contain spaces.
ar: لا يمكن أن يحتوي المضيف على مسافات.
de: Der Host darf keine Leerzeichen enthalten.
es: El host no puede contener espacios.
fr: L'hôte ne peut pas contenir d'espaces.
ja: ホスト名にスペースを含めることはできません。
ko: 호스트에는 공백을 포함할 수 없습니다.
ru: Хост не может содержать пробелы.
uk: Хост не може містити пробіли.
zh_hans: 主机名不能包含空格。
zh_hk: 主機名稱不能包含空白。

source: Host:
ar: المضيف:
fr: Hôte :
ja: ホスト:
ko: 호스트:
ru: Хост:
uk: Хост:
zh_hans: 主机：
zh_hk: 主機：

source: Hours
ar: ساعات
de: Stunden
es: Horas
fr: Heures
ja: 時間
ko: 시간
ru: ч
uk: год
zh_hans: 小时
zh_hk: 小時

source: How to Set Up
ar: كيفية الإعداد
de: Einrichtung
es: Cómo Configurar
fr: Comment configurer
ja: 設定方法
ko: 설정 방법
ru: Инструкция по настройке
uk: Інструкція з налаштування
zh_hans: 如何设置
zh_hk: 如何設定

source: How to set up local network permission.
ar: كيفية إعداد إذن الشبكة المحلية.
de: So richten Sie die lokale Netzwerkberechtigung ein.
es: Cómo configurar el permiso de red local.
fr: Comment configurer l'autorisation du réseau local.
ja: ローカルネットワーク許可の設定方法。
ko: 로컬 네트워크 권한 설정 방법.
ru: Как настроить доступ к локальной сети.
uk: Як налаштувати доступ до локальної мережі.
zh_hans: 如何设置本地网络权限。
zh_hk: 如何設定區域網絡權限。

source: I would be so glad if you could give a star to the repository!
ar: سأكون سعيدًا جدًا إذا منحت المستودع نجمة!
de: Ich würde mich sehr freuen, wenn Sie dem Repository einen Stern geben könnten!
es: ¡Me alegraría mucho si pudieras darle una estrella al repositorio!
fr: Je serais ravi si vous pouviez donner une étoile au dépôt !
ja: リポジトリにスターをつけてくれるととてもうれしいです！
ko: 저장소에 별을 눌러주시면 큰 힘이 됩니다!
ru: Я буду очень рад, если вы поставите звезду репозиторию!
uk: Я буду дуже радий, якщо ви поставите зірку репозиторію!
zh_hans: 如果您能为仓库点亮星标，我将不胜感激！
zh_hk: 如果您能為倉庫點亮星標，我將不勝感激！

source: If it takes time to load large models, increasing the API timeout in Mocolamma settings or changing it to unlimited may help.
ar: إذا استغرق تحميل النماذج الكبيرة وقتًا، فقد يساعد زيادة مهلة API في إعدادات Mocolamma أو تغييرها إلى غير محدودة.
de: Wenn das Laden großer Modelle Zeit in Anspruch nimmt, kann es helfen, das API-Timeout in den Mocolamma-Einstellungen zu erhöhen oder auf unbegrenzt zu setzen.
es: Si tarda tiempo en cargar modelos grandes, aumentar el tiempo de espera de la API en los ajustes de Mocolamma o cambiarlo a ilimitado puede ayudar.
fr: Si le chargement de modèles volumineux prend du temps, augmenter le délai d'expiration de l'API dans les réglages de Mocolamma ou le passer sur illimité peut aider.
ja: 大きなモデルの読み込みなどに時間がかかる場合、Mocolammaの設定でAPIタイムアウトを長くするか、無制限に変更すると改善する可能性があります。
ko: 대형 모델을 불러오는 데 시간이 걸리는 경우, Mocolamma 설정에서 API 타임아웃을 늘리거나 무제한으로 변경하면 도움이 될 수 있습니다.
ru: Если загрузка больших моделей занимает много времени, попробуйте увеличить тайм-аут API в настройках Mocolamma или установите его на «Без ограничений».
uk: Якщо завантаження великих моделей займає багато часу, спробуйте збільшити тайм-аут API в налаштуваннях Mocolamma або встановіть його на «Без обмежень».
zh_hans: 如果加载大型模型需要较长时间，增加 Mocolamma 设置中的 API 超时时间或将其更改为“无限制”可能会有所帮助。
zh_hk: 如果載入大型模型需要較長時間，增加 Mocolamma 設定中的 API 超時時間或將其更改為「無限制」可能會有幫助。

source: If responses take longer, such as when loading large models, increasing the timeout may help.
ar: إذا استغرقت الاستجابات وقتًا أطول، كما هو الحال عند تحميل النماذج الكبيرة، فقد يساعد زيادة المهلة.
de: Wenn Antworten länger dauern, z.B. beim Laden großer Modelle, kann eine Erhöhung des Timeouts helfen.
es: Si las respuestas tardan más, como al cargar modelos grandes, aumentar el tiempo de espera puede ayudar.
fr: Si les réponses prennent plus de temps, comme lors du chargement de grands modèles, l'augmentation du délai d'attente peut aider.
ja: 大きなモデルを読み込む場合など、応答に時間がかかる場合はタイムアウトを長くすることで改善する可能性があります。
ko: 대형 모델 로드 등 응답이 오래 걸리는 경우 타임아웃을 늘리면 도움이 될 수 있습니다.
ru: Если ответы приходят долго, например при загрузке больших моделей, увеличение тайм-аута может помочь.
uk: Якщо відповіді приходять довго, наприклад при завантаженні великих моделей, збільшення тайм-ауту може допомогти.
zh_hans: 如果响应时间较长（例如加载大型模型时），增加超时时间可能会有所帮助。
zh_hk: 如果回應時間較長（例如載入大型模型時），增加超時時間可能會有幫助。

source: If you turn off stream response, it is recommended to set the API timeout to unlimited in the settings.
ar: إذا قمت بإيقاف تشغيل الاستجابة المتدفقة، يوصى بضبط مهلة API على غير محدودة في الإعدادات.
de: Wenn Sie die Stream-Antwort deaktivieren, wird empfohlen, das API-Timeout in den Einstellungen auf unbegrenzt zu setzen.
es: Si desactivas la respuesta en streaming, se recomienda establecer el tiempo de espera de la API en ilimitado en los ajustes.
fr: Si vous désactivez la réponse en streaming, il est recommandé de définir le délai d'attente de l'API sur illimité dans les paramètres.
ja: ストリームレスポンスをオフにする場合、設定からAPIタイムアウトを無制限にすることをおすすめします。
ko: 스트림 응답을 끄는 경우, 설정에서 API 타임아웃을 무제한으로 설정하는 것을 권장합니다.
ru: При отключении потоковых ответов рекомендуется установить тайм-аут API на «Без ограничений» в настройках.
uk: При відключенні потокових відповідей рекомендується встановити тайм-аут API на «Без обмежень» у налаштуваннях.
zh_hans: 如果您关闭流式响应，建议在设置中将 API 超时时间设置为“无限制”。
zh_hk: 如果您關閉串流回應，建議在設定中将 API 超時時間設定為「無限制」。

source: If you're not sure what to enter, you can find models on the Ollama website.
ar: إذا لم تكن متأكدًا مما تريد إدخاله، يمكنك العثور على النماذج على موقع Ollama الإلكتروني.
de: Wenn Sie nicht wissen, was Sie eingeben sollen, finden Sie Modelle auf der Ollama-Website von Ollama.
es: Si no estás seguro de qué introducir, puedes encontrar modelos en el sitio web de Ollama.
fr: Si vous n'êtes pas sûr de ce qu'il faut saisir, vous pouvez trouver des modèles sur le site Web d'Ollama.
ja: 何を入力したら良いかわからない場合、Ollamaのウェブサイトでモデルを探すことができます。
ko: 무엇을 입력해야 할지 모르겠다면 Ollama 웹사이트에서 모델을 찾을 수 있습니다.
ru: Если вы не знаете, что вводить, вы можете найти модели на сайте Ollama.
uk: Якщо ви не впевнені, що вводити, ви можете знайти моделі на сайті Ollama.
zh_hans: 如果您不确定要输入什么，可以在 Ollama 网站上寻找模型。
zh_hk: 如果您不確定要輸入什麼，可以在 Ollama 網站上尋找模型。

source: Image
ar: صورة
de: Bild
es: Imagen
ja: 画像
ko: 이미지
ru: Изображение
uk: Зображення
zh_hans: 图像
zh_hk: 圖片

source: Image Generation
ar: توليد الصور
de: Bilderzeugung
es: Generación de imágenes
fr: Génération d'images
ja: 画像生成
ko: 이미지 생성
ru: Генерация изображений
uk: Генерація зображень
zh_hans: 图像生成
zh_hk: 圖片生成

source: Image Generation Settings
ar: إعدادات توليد الصور
de: Bilderzeugungseinstellungen
es: Configuración de generación de imágenes
fr: Paramètres de génération d'images
ja: 画像生成設定
ko: 이미지 생성 설정
ru: Настройки генерации изображений
uk: Налаштування генерації зображень
zh_hans: 图像生成设置
zh_hk: 圖片生成設定

source: Inspector
ar: المفتش
de: Inspektor
fr: Inspecteur
ja: インスペクタ
ko: 인스펙터
ru: Инспектор
uk: Інспектор
zh_hans: 检查器
zh_hk: 檢查器

source: Keep Alive
ar: الإبقاء حيًا
es: Mantener vivo
ja: キープアライブ
ko: 유지 시간
ru: Удержание
uk: Утримання
zh_hans: 保持活动
zh_hk: 保持活動

# KeepAlive_1h
source: 1 Hour
ar: ساعة واحدة
de: 1 Stunde
es: 1 hora
fr: 1 heure
ja: 1時間
ko: 1시간
ru: 1 час
uk: 1 година
zh_hans: 1 小时
zh_hk: 1 小時

# KeepAlive_1m
source: 1 Minute
ar: دقيقة واحدة
es: 1 minuto
ja: 1分
ko: 1분
ru: 1 минута
uk: 1 хвилина
zh_hans: 1 分钟
zh_hk: 1 分鐘

# KeepAlive_3m
source: 3 Minutes
ar: 3 دقائق
de: 3 Minuten
es: 3 minutos
ja: 3分
ko: 3분
ru: 3 минуты
uk: 3 хвилини
zh_hans: 3 分钟
zh_hk: 3 分鐘

# KeepAlive_5m
source: 5 Minutes
ar: 5 دقائق
de: 5 Minuten
es: 5 minutos
ja: 5分
ko: 5분
ru: 5 минут
uk: 5 хвилин
zh_hans: 5 分钟
zh_hk: 5 分鐘

# KeepAlive_10m
source: 10 Minutes
ar: 10 دقائق
de: 10 Minuten
es: 10 minutos
ja: 10分
ko: 10분
ru: 10 минут
uk: 10 хвилин
zh_hans: 10 分钟
zh_hk: 10 分鐘

# KeepAlive_15m
source: 15 Minutes
ar: 15 دقيقة
de: 15 Minuten
es: 15 minutos
ja: 15分
ko: 15분
ru: 15 минут
uk: 15 хвилин
zh_hans: 15 分钟
zh_hk: 15 分鐘

# KeepAlive_30m
source: 30 Minutes
ar: 30 دقيقة
de: 30 Minuten
es: 30 minutos
ja: 30分
ko: 30분
ru: 30 минут
uk: 30 хвилин
zh_hans: 30 分钟
zh_hk: 30 分鐘
